{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5f62dedf-160f-47a6-b63a-5508b32f07d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Langchain\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain.chains import RetrievalQAWithSourcesChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "import csv\n",
    "import pandas as pd\n",
    "import time\n",
    "import os\n",
    "\n",
    "# Common data processing\n",
    "import json\n",
    "import textwrap\n",
    "\n",
    "# Warning control\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b39e9917-8127-40c4-a33b-127e0a749088",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load from environment\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE') or 'neo4j'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "be905dbe-2da6-455c-8cee-fcc9f5b23ec8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>show_id</th>\n",
       "      <th>type</th>\n",
       "      <th>title</th>\n",
       "      <th>director</th>\n",
       "      <th>cast</th>\n",
       "      <th>country</th>\n",
       "      <th>date_added</th>\n",
       "      <th>release_year</th>\n",
       "      <th>rating</th>\n",
       "      <th>duration</th>\n",
       "      <th>listed_in</th>\n",
       "      <th>description</th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>81145628</td>\n",
       "      <td>Movie</td>\n",
       "      <td>Norm of the North: King Sized Adventure</td>\n",
       "      <td>Richard Finn, Tim Maltby</td>\n",
       "      <td>Alan Marriott, Andrew Toth, Brian Dobson, Cole...</td>\n",
       "      <td>United States, India, South Korea, China</td>\n",
       "      <td>2019-09-09</td>\n",
       "      <td>2019</td>\n",
       "      <td>TV-PG</td>\n",
       "      <td>90 min</td>\n",
       "      <td>Children &amp; Family Movies, Comedies</td>\n",
       "      <td>Before planning an awesome wedding for his gra...</td>\n",
       "      <td>2019.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>80117401</td>\n",
       "      <td>Movie</td>\n",
       "      <td>Jandino: Whatever it Takes</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Jandino Asporaat</td>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>2016-09-09</td>\n",
       "      <td>2016</td>\n",
       "      <td>TV-MA</td>\n",
       "      <td>94 min</td>\n",
       "      <td>Stand-Up Comedy</td>\n",
       "      <td>Jandino Asporaat riffs on the challenges of ra...</td>\n",
       "      <td>2016.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>70234439</td>\n",
       "      <td>TV Show</td>\n",
       "      <td>Transformers Prime</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Peter Cullen, Sumalee Montano, Frank Welker, J...</td>\n",
       "      <td>United States</td>\n",
       "      <td>2018-09-08</td>\n",
       "      <td>2013</td>\n",
       "      <td>TV-Y7-FV</td>\n",
       "      <td>1 Season</td>\n",
       "      <td>Kids' TV</td>\n",
       "      <td>With the help of three human allies, the Autob...</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>80058654</td>\n",
       "      <td>TV Show</td>\n",
       "      <td>Transformers: Robots in Disguise</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Will Friedle, Darren Criss, Constance Zimmer, ...</td>\n",
       "      <td>United States</td>\n",
       "      <td>2018-09-08</td>\n",
       "      <td>2016</td>\n",
       "      <td>TV-Y7</td>\n",
       "      <td>1 Season</td>\n",
       "      <td>Kids' TV</td>\n",
       "      <td>When a prison ship crash unleashes hundreds of...</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>80125979</td>\n",
       "      <td>Movie</td>\n",
       "      <td>#realityhigh</td>\n",
       "      <td>Fernando Lebrija</td>\n",
       "      <td>Nesta Cooper, Kate Walsh, John Michael Higgins...</td>\n",
       "      <td>United States</td>\n",
       "      <td>2017-09-08</td>\n",
       "      <td>2017</td>\n",
       "      <td>TV-14</td>\n",
       "      <td>99 min</td>\n",
       "      <td>Comedies</td>\n",
       "      <td>When nerdy high schooler Dani finally attracts...</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    show_id     type                                    title  \\\n",
       "0  81145628    Movie  Norm of the North: King Sized Adventure   \n",
       "1  80117401    Movie               Jandino: Whatever it Takes   \n",
       "2  70234439  TV Show                       Transformers Prime   \n",
       "3  80058654  TV Show         Transformers: Robots in Disguise   \n",
       "4  80125979    Movie                             #realityhigh   \n",
       "\n",
       "                   director  \\\n",
       "0  Richard Finn, Tim Maltby   \n",
       "1                       NaN   \n",
       "2                       NaN   \n",
       "3                       NaN   \n",
       "4          Fernando Lebrija   \n",
       "\n",
       "                                                cast  \\\n",
       "0  Alan Marriott, Andrew Toth, Brian Dobson, Cole...   \n",
       "1                                   Jandino Asporaat   \n",
       "2  Peter Cullen, Sumalee Montano, Frank Welker, J...   \n",
       "3  Will Friedle, Darren Criss, Constance Zimmer, ...   \n",
       "4  Nesta Cooper, Kate Walsh, John Michael Higgins...   \n",
       "\n",
       "                                    country date_added  release_year  \\\n",
       "0  United States, India, South Korea, China 2019-09-09          2019   \n",
       "1                            United Kingdom 2016-09-09          2016   \n",
       "2                             United States 2018-09-08          2013   \n",
       "3                             United States 2018-09-08          2016   \n",
       "4                             United States 2017-09-08          2017   \n",
       "\n",
       "     rating  duration                           listed_in  \\\n",
       "0     TV-PG    90 min  Children & Family Movies, Comedies   \n",
       "1     TV-MA    94 min                     Stand-Up Comedy   \n",
       "2  TV-Y7-FV  1 Season                            Kids' TV   \n",
       "3     TV-Y7  1 Season                            Kids' TV   \n",
       "4     TV-14    99 min                            Comedies   \n",
       "\n",
       "                                         description    year  month  day  \n",
       "0  Before planning an awesome wedding for his gra...  2019.0    9.0  9.0  \n",
       "1  Jandino Asporaat riffs on the challenges of ra...  2016.0    9.0  9.0  \n",
       "2  With the help of three human allies, the Autob...  2018.0    9.0  8.0  \n",
       "3  When a prison ship crash unleashes hundreds of...  2018.0    9.0  8.0  \n",
       "4  When nerdy high schooler Dani finally attracts...  2017.0    9.0  8.0  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# load the data\n",
    "df = pd.read_csv('/mnt/code/data/netflix_titles.csv')\n",
    "df[\"date_added\"] = pd.to_datetime(df['date_added'])\n",
    "df['year'] = df['date_added'].dt.year\n",
    "df['month'] = df['date_added'].dt.month\n",
    "df['day'] = df['date_added'].dt.day\n",
    "\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "c82daf34-f060-4ad2-b344-0c27333b7f99",
   "metadata": {},
   "outputs": [],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2f1a6dd6-684f-421b-a008-338fadaa42c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# DELETE ALL NODES AND RELATIONSHIPS\n",
    "request_delete =\"\"\"\n",
    "MATCH (n) DETACH DELETE n;\n",
    "\"\"\"\n",
    "kg.query(request_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e0fac514-3a9e-4074-ba2c-6d66358a71f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "csv_file_path = \"/mnt/code/data/netflix_titles.csv\"\n",
    "\n",
    "# Connect to Neo4j\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "\n",
    "# Function to insert data from CSV to Neo4j\n",
    "def insert_data_from_csv(driver, csv_file_path):\n",
    "    with driver.session() as session:\n",
    "        with open(csv_file_path, 'r', encoding='utf-8') as file:\n",
    "            reader = csv.DictReader(file)\n",
    "            for row in reader:\n",
    "                session.run(\"\"\"\n",
    "                    CREATE (m:Movie {\n",
    "                        id: $show_id,\n",
    "                        type: $type,\n",
    "                        title: $title,\n",
    "                        director: $director,\n",
    "                        cast: $cast,\n",
    "                        country: $country,\n",
    "                        date_added: $date_added,\n",
    "                        release_year: $release_year,\n",
    "                        rating: $rating,\n",
    "                        duration: $duration,\n",
    "                        listed_in: $listed_in,\n",
    "                        description: $description\n",
    "                    })\n",
    "                \"\"\", parameters=row)\n",
    "\n",
    "# Execute the function\n",
    "insert_data_from_csv(driver, csv_file_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e60af15f-280e-4803-b575-c543fe4b7704",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Cypher queries to setup the nodes and relationships\n",
    "create_acted_in_rel = \"\"\"\n",
    "MATCH (m:Movie)\n",
    "WHERE m.cast IS NOT NULL\n",
    "WITH m\n",
    "UNWIND split(m.cast, ',') AS actor\n",
    "MERGE (p:Person {name: trim(actor)})\n",
    "MERGE (p)-[r:ACTED_IN]->(m);\n",
    "\"\"\"\n",
    "\n",
    "create_category =\"\"\"    \n",
    "MATCH (m:Movie)\n",
    "WHERE m.listed_in IS NOT NULL\n",
    "WITH m\n",
    "UNWIND split(m.listed_in, ',') AS category\n",
    "MERGE (c:Category {name: trim(category)})\n",
    "MERGE (m)-[r:IN_CATEGORY]->(c);\n",
    "\"\"\"    \n",
    "\n",
    "# CREATE TYPE\n",
    "create_type = \"\"\" \n",
    "MATCH (m:Movie)\n",
    "WHERE m.type IS NOT NULL\n",
    "WITH m\n",
    "MERGE (t:Type {type: m.type})\n",
    "MERGE (m)-[r:TYPED_AS]->(t);\n",
    "\"\"\"\n",
    "\n",
    "# CREATE DIRECTOR\n",
    "create_director = \"\"\" \n",
    "MATCH (m:Movie)\n",
    "WHERE m.director IS NOT NULL\n",
    "WITH m\n",
    "MERGE (d:Person {name: m.director})\n",
    "MERGE (d)-[r:DIRECTED]->(m);\n",
    "\"\"\"\n",
    "\n",
    "# CREATE COUNTRIES\n",
    "create_countries = \"\"\" \n",
    "MATCH (m:Movie)\n",
    "WHERE m.country IS NOT NULL\n",
    "MERGE (c:Country {name: trim(m.country)})\n",
    "MERGE (m)-[:WHERE]->(c);\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# DELETE UNUSED PROPERTY; you can skip this if you want\n",
    "del_unused = \"\"\"\n",
    "MATCH(m:Movie)\n",
    "SET m.country = null, m.category = null,m.type = null , m.director = null , m.cast =null\n",
    "\"\"\"\n",
    "\n",
    "# BUILD THE WORK_WITH RELATIONSHIP\n",
    "create_work_with_rel = \"\"\"\n",
    "MATCH (p:Person)-[rel:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(p2:Person)\n",
    "MERGE (p)-[r:WORK_WITH]-(p2);\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# Create Time Tree Index\n",
    "create_time_tree_index=\"\"\"\n",
    "CREATE INDEX FOR (y:Year) ON (y.value);\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# Create Years\n",
    "create_years=\"\"\"\n",
    "WITH range(2012, 2019) AS years, range(1,12) AS months\n",
    "FOREACH(year IN years |\n",
    "  CREATE (y:Year {value: year}));\n",
    "\"\"\"\n",
    "\n",
    "# Connect Years Sequentially\n",
    "connect_years=\"\"\"\n",
    "MATCH (year:Year)\n",
    "WITH year\n",
    "ORDER BY year.value\n",
    "WITH collect(year) AS years\n",
    "FOREACH(i in RANGE(0, size(years)-2) |\n",
    "    FOREACH(year1 in [years[i]] |\n",
    "        FOREACH(year2 in [years[i+1]] |\n",
    "            MERGE (year1)-[:NEXT]->(year2))));\n",
    "\"\"\"\n",
    "\n",
    "#connect each movie in the database to a node representing the year it was released, using a CREATED_ON relationship\n",
    "create_created_on_rel=\"\"\"\n",
    "MATCH (m:Movie)\n",
    "WHERE m.release_year IS NOT NULL\n",
    "WITH m, toInteger(m.release_year) AS y\n",
    "MATCH (year:Year {value: y})\n",
    "MERGE (m)-[:CREATED_ON]->(year)\n",
    "\"\"\"\n",
    "\n",
    "queries = [create_acted_in_rel,\n",
    "           create_category,\n",
    "           create_type,\n",
    "           create_director,\n",
    "           create_countries,\n",
    "           del_unused,\n",
    "           create_work_with_rel,\n",
    "           create_time_tree_index,\n",
    "           create_years,\n",
    "           connect_years,\n",
    "           create_created_on_rel]\n",
    "\n",
    "with driver.session() as session:\n",
    "    for query in queries:\n",
    "        session.run(query)\n",
    "        \n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d6946990-deee-4f58-865c-b50e45c31a81",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to Neo4j\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "\n",
    "# Count by category\n",
    "request=\"\"\"\n",
    "MATCH (c:Category)<-[rel:IN_CATEGORY]-(m:Movie)\n",
    "WITH c.name as category,count(*) as total\n",
    "RETURN  category,total\n",
    "ORDER BY total DESC\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    results = session.run(request)\n",
    "    df = pd.DataFrame([dict(record) for record in results])\n",
    "driver.close()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d07c5761-127b-4093-97e1-a3fb3e8f3e52",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Lets get a vector index for the embeddings\n",
    "kg.query(\"\"\"\n",
    "  CREATE VECTOR INDEX movie_description_embeddings IF NOT EXISTS\n",
    "  FOR (m:Movie) ON (m.descriptionEmbedding) \n",
    "  OPTIONS { indexConfig: {\n",
    "    `vector.dimensions`: 1536,\n",
    "    `vector.similarity_function`: 'cosine'\n",
    "  }}\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "684db114-3b62-4d54-847a-9c5cc152aa87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 1,\n",
       "  'name': 'movie_description_embeddings',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'VECTOR',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Movie'],\n",
       "  'properties': ['descriptionEmbedding'],\n",
       "  'indexProvider': 'vector-2.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# List all the vector indices\n",
    "kg.query(\"\"\"\n",
    "  SHOW VECTOR INDEXES\n",
    "  \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "46f6657d-c5a2-4843-9f44-6b4acdd361a0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Compute the embeddings and store them in the movie node as a property\n",
    "kg.query(\"\"\"\n",
    "    MATCH (movie:Movie) WHERE movie.description IS NOT NULL\n",
    "    WITH movie, genai.vector.encode(\n",
    "        movie.description, \n",
    "        \"OpenAI\", \n",
    "        {\n",
    "          token: $openAiApiKey\n",
    "        }) AS vector\n",
    "    CALL db.create.setNodeVectorProperty(movie, \"descriptionEmbedding\", vector)\n",
    "    \"\"\", \n",
    "    params={\"openAiApiKey\":OPENAI_API_KEY} )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "3ae450b1-f886-45f6-81fb-928c1050b092",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Let's test it out\n",
    "question = \"What movies are about love?\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "98baae12-92a1-4488-95f9-cb4c64f0827a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie.title': 'Manhattan Romance',\n",
       "  'movie.description': 'A filmmaker working on a documentary about love in modern Manhattan becomes personally entangled in the romantic lives of his subjects.',\n",
       "  'score': 0.9291431903839111},\n",
       " {'movie.title': 'Dilwale',\n",
       "  'movie.description': 'A young couple falls in love, but conflicting loyalties drive them apart. Years later, fate intervenes and hands them a second chance.',\n",
       "  'score': 0.919033408164978},\n",
       " {'movie.title': 'My Dear Boy',\n",
       "  'movie.description': 'Heartbroken and romantically pessimistic, a commercial director meets a young artist and teaches him life-changing lessons about love.',\n",
       "  'score': 0.9179035425186157},\n",
       " {'movie.title': 'Steal a Pencil for Me',\n",
       "  'movie.description': 'This moving documentary chronicles the unshakeable romance between a couple who met and fell in love while imprisoned in a Nazi concentration camp.',\n",
       "  'score': 0.9178396463394165},\n",
       " {'movie.title': 'Love Rain',\n",
       "  'movie.description': \"A story of two couples' journey of new love, loss and unexpected reunion spans decades, from the 1970s through present day.\",\n",
       "  'score': 0.9174087047576904}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Run a query against the vector embeddings i.e perform semantic search\n",
    "kg.query(\"\"\"\n",
    "    WITH genai.vector.encode(\n",
    "        $question, \n",
    "        \"OpenAI\", \n",
    "        {\n",
    "          token: $openAiApiKey\n",
    "        }) AS question_embedding\n",
    "    CALL db.index.vector.queryNodes(\n",
    "        'movie_description_embeddings', \n",
    "        $top_k, \n",
    "        question_embedding\n",
    "        ) YIELD node AS movie, score\n",
    "    RETURN movie.title, movie.description, score\n",
    "    \"\"\", \n",
    "    params={\"openAiApiKey\":OPENAI_API_KEY,\n",
    "            \"question\": question,\n",
    "            \"top_k\": 5\n",
    "            })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a8edf6aa-3a6a-4c31-a20e-996a05f84a9a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
